app/policies/task_policy.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create?
    return false unless record.project_id.present?

    project = record.project || Project.find_by(id: record.project_id)