app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "role", "auth_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def register
        user = User.new(register_params)
        user.save!

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
      def login
        user = User.find_by(email: params[:email]&.downcase)