app/controllers/api/v1/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
---
      def index
        tasks = policy_scope(Task)
                  .includes(:project, :assignee)
                  .by_status(params[:status])
                  .by_assignee(params[:assignee_id])
                  .by_project(params[:project_id])
                  .sorted_by(params[:sort_by], params[:sort_dir])
                  .page(params[:page])
                  .per(params[:per_page] || 15)

INSERT INTO "tasks" ("title", "status", "priority", "due_date", "project_id", "assignee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
        task = Task.new(task_params)
        authorize task   # policy checks manager ownership

        task.save!

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
      def set_task
        @task = Task.includes(:project, :assignee).find(params[:id])