app/controllers/application_controller.rb

  def authenticate_user!
    header = request.headers["Authorization"]
    raise AuthenticationError, "Missing Authorization header." if header.blank?

    token   = header.split(" ").last
    payload = JwtService.decode(token)
    @current_user = User.find(payload[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]